fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммуАбонентскойПлаты</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/CommonModules/ВКМ_РаботаСФормами/Module.bsl
#Область ПрограммныйИнтерфейс 

//@skip-check export-procedure-missing-comment
//@skip-check doc-comment-parameter-section
Процедура ДополнитьФормы(Форма)  Экспорт
	
	//Какую Форму дополняем
	Если Форма.ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ВКМ_ФормаЭлемента" Тогда
		ДобавитьПоляНаФорму(Форма);
	КонецЕсли;	
	
	Если Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКомандуНаФорму (Форма);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПоляНаФорму(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("Номер",Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Код"; 
	
	ПолеВвода = Форма.Элементы.Добавить("Наименование",Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Наименование"; 
	
	ПолеВвода = Форма.Элементы.Добавить("Контрагент",Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Владелец"; 
	
	ПолеВвода = Форма.Элементы.Добавить("Организация",Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Организация"; 
	
	ПолеВвода = Форма.Элементы.Добавить("ВидДоговора",Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВидДоговора"; 
	
	ГруппаФормы = Форма.Элементы.Добавить("ДляДоговораАбонента",Тип("ГруппаФормы"));
	ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;		
	ГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ГруппаФормы = Форма.Элементы.Добавить("ПериодОбслуживания",Тип("ГруппаФормы"),Форма.Элементы.ДляДоговораАбонента);
	ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;		
	ГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ПолеВвода = Форма.Элементы.Добавить("С",Тип("ПолеФормы"),Форма.Элементы.ПериодОбслуживания);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДоговора"; 
	
	ПолеВвода = Форма.Элементы.Добавить("По",Тип("ПолеФормы"),Форма.Элементы.ПериодОбслуживания);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДоговора"; 
	
	ПолеВвода = Форма.Элементы.Добавить("СуммаАбоненскойПлаты",Тип("ПолеФормы"),Форма.Элементы.ДляДоговораАбонента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммуАбонентскойПлаты"; 
	
	ПолеВвода = Форма.Элементы.Добавить("СтоимостьЧасаРаботы",Тип("ПолеФормы"),Форма.Элементы.ДляДоговораАбонента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
	ДобавитьОбрабочикИзмененияТипаДоговора(Форма);
КонецПроцедуры

Процедура ДобавитьОбрабочикИзмененияТипаДоговора(Форма)
	
	Форма.Элементы.ВидДоговора.УстановитьДействие("ПриИзменении","ВидДоговораПриИзменении");
	
КонецПроцедуры

Процедура ДобавитьКомандуНаФорму (Форма)
	
    //Создаем команду для форме
    Команда = Форма.Команды.Добавить("Заполнить");
	Команда.Заголовок = "Заполнить";
	Команда.Действие = "ВКМ_ПроверкаДоговораИВызовАвтозаполнения";
	
	// Выносим команду на форму в виде кнопки обычной
	КнопкаФормы = Форма.Элементы.Добавить("Заполнить",Тип("КнопкаФормы"),Форма.Элементы.ФормаКоманднаяПанель); 
	КнопкаФормы.ИмяКоманды = "Заполнить";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
  
	
КонецПроцедуры
  #КонецОбласти
